InformationRegisters/НастройкиПечатныхФормБЗК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПечатныхФормБЗК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СодержимоеДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СодержимоеДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БлокировкаСУсловием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаСписокСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКодДокументаКадровогоМероприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыДокументовКадровыхМероприятий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВариантПодписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыПодписанияДокументовЭДОБЗК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДОБЗК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Предопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскоеНаименование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПечатныхФормБЗК/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ФормаУдалить",
		"Видимость",
		Не Запись.Предопределенный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИдентификаторПечатнойФормы",
		"ТолькоПросмотр",
		Запись.Предопределенный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВидДокумента",
		"ТолькоПросмотр",
		Запись.Предопределенный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"Наименование",
		"КнопкаОчистки",
		Запись.Предопределенный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВариантПодписания",
		"Видимость",
		Не Запись.Предопределенный
			И ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("2.1")
				И Не ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("3.3"));
	
	УстановитьОтображениеПодсказкиВидаДокумента(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Предопределенный Тогда
		ТекущийОбъект.ПользовательскоеНаименование =
			ТекущийОбъект.Наименование <> НаименованиеПредопределенного(ТекущийОбъект.ИдентификаторПечатнойФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеОчистка(Элемент, СтандартнаяОбработка)
	
	Если Запись.Предопределенный Тогда
		СтандартнаяОбработка = Ложь;
		Запись.Наименование = НаименованиеПредопределенного(Запись.ИдентификаторПечатнойФормы);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	УстановитьОтображениеПодсказкиВидаДокумента(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НаименованиеПредопределенного(ИдентификаторПечатнойФормы)
	
	НастройкиПечатныхФормПоУмолчанию = ЭДОБЗК.ОписанияНастроекПечатныхФормПоУмолчанию();
	НастрокиПечатнойФормы = НастройкиПечатныхФормПоУмолчанию.Найти(ИдентификаторПечатнойФормы, "ИдентификаторПечатнойФормы");
	Если НастрокиПечатнойФормы <> Неопределено Тогда
		Возврат НастрокиПечатнойФормы.Наименование;
	КонецЕсли;
	
	Возврат ИдентификаторПечатнойФормы;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтображениеПодсказкиВидаДокумента(УправляемаяФорма)
	
	ЭДОБЗККлиентСервер.УстановитьПодсказкуОКодеВидаДокумента(
		УправляемаяФорма, "ВидДокумента", УправляемаяФорма.Запись.ВидДокумента);
	
КонецПроцедуры

#КонецОбласти
